Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_dppic.h
// CHENCLR Configuration

#define DPPIC_CHENCLR_CH31                      (0x1U<<31)
#define DPPIC_CHENCLR_CH30                      (0x1U<<30)
#define DPPIC_CHENCLR_CH29                      (0x1U<<29)
#define DPPIC_CHENCLR_CH28                      (0x1U<<28)
#define DPPIC_CHENCLR_CH27                      (0x1U<<27)
#define DPPIC_CHENCLR_CH26                      (0x1U<<26)
#define DPPIC_CHENCLR_CH25                      (0x1U<<25)
#define DPPIC_CHENCLR_CH24                      (0x1U<<24)
#define DPPIC_CHENCLR_CH23                      (0x1U<<23)
#define DPPIC_CHENCLR_CH22                      (0x1U<<22)
#define DPPIC_CHENCLR_CH21                      (0x1U<<21)
#define DPPIC_CHENCLR_CH20                      (0x1U<<20)
#define DPPIC_CHENCLR_CH19                      (0x1U<<19)
#define DPPIC_CHENCLR_CH18                      (0x1U<<18)
#define DPPIC_CHENCLR_CH17                      (0x1U<<17)
#define DPPIC_CHENCLR_CH16                      (0x1U<<16)
#define DPPIC_CHENCLR_CH15                      (0x1U<<15)
#define DPPIC_CHENCLR_CH14                      (0x1U<<14)
#define DPPIC_CHENCLR_CH13                      (0x1U<<13)
#define DPPIC_CHENCLR_CH12                      (0x1U<<12)
#define DPPIC_CHENCLR_CH11                      (0x1U<<11)
#define DPPIC_CHENCLR_CH10                      (0x1U<<10)
#define DPPIC_CHENCLR_CH9                       (0x1U<<9)
#define DPPIC_CHENCLR_CH8                       (0x1U<<8)
#define DPPIC_CHENCLR_CH7                       (0x1U<<7)
#define DPPIC_CHENCLR_CH6                       (0x1U<<6)
#define DPPIC_CHENCLR_CH5                       (0x1U<<5)
#define DPPIC_CHENCLR_CH4                       (0x1U<<4)
#define DPPIC_CHENCLR_CH3                       (0x1U<<3)
#define DPPIC_CHENCLR_CH2                       (0x1U<<2)
#define DPPIC_CHENCLR_CH1                       (0x1U<<1)
#define DPPIC_CHENCLR_CH0                       (0x1U<<0)
#define DPPIC_CHENCLR_CH31_DISABLED             (0x0U<<31)
#define DPPIC_CHENCLR_CH31_ENABLED              (0x1U<<31)
#define DPPIC_CHENCLR_CH31_CLEAR                (0x1U<<31)
#define DPPIC_CHENCLR_CH30_DISABLED             (0x0U<<30)
#define DPPIC_CHENCLR_CH30_ENABLED              (0x1U<<30)
#define DPPIC_CHENCLR_CH30_CLEAR                (0x1U<<30)
#define DPPIC_CHENCLR_CH29_DISABLED             (0x0U<<29)
#define DPPIC_CHENCLR_CH29_ENABLED              (0x1U<<29)
#define DPPIC_CHENCLR_CH29_CLEAR                (0x1U<<29)
#define DPPIC_CHENCLR_CH28_DISABLED             (0x0U<<28)
#define DPPIC_CHENCLR_CH28_ENABLED              (0x1U<<28)
#define DPPIC_CHENCLR_CH28_CLEAR                (0x1U<<28)
#define DPPIC_CHENCLR_CH27_DISABLED             (0x0U<<27)
#define DPPIC_CHENCLR_CH27_ENABLED              (0x1U<<27)
#define DPPIC_CHENCLR_CH27_CLEAR                (0x1U<<27)
#define DPPIC_CHENCLR_CH26_DISABLED             (0x0U<<26)
#define DPPIC_CHENCLR_CH26_ENABLED              (0x1U<<26)
#define DPPIC_CHENCLR_CH26_CLEAR                (0x1U<<26)
#define DPPIC_CHENCLR_CH25_DISABLED             (0x0U<<25)
#define DPPIC_CHENCLR_CH25_ENABLED              (0x1U<<25)
#define DPPIC_CHENCLR_CH25_CLEAR                (0x1U<<25)
#define DPPIC_CHENCLR_CH24_DISABLED             (0x0U<<24)
#define DPPIC_CHENCLR_CH24_ENABLED              (0x1U<<24)
#define DPPIC_CHENCLR_CH24_CLEAR                (0x1U<<24)
#define DPPIC_CHENCLR_CH23_DISABLED             (0x0U<<23)
#define DPPIC_CHENCLR_CH23_ENABLED              (0x1U<<23)
#define DPPIC_CHENCLR_CH23_CLEAR                (0x1U<<23)
#define DPPIC_CHENCLR_CH22_DISABLED             (0x0U<<22)
#define DPPIC_CHENCLR_CH22_ENABLED              (0x1U<<22)
#define DPPIC_CHENCLR_CH22_CLEAR                (0x1U<<22)
#define DPPIC_CHENCLR_CH21_DISABLED             (0x0U<<21)
#define DPPIC_CHENCLR_CH21_ENABLED              (0x1U<<21)
#define DPPIC_CHENCLR_CH21_CLEAR                (0x1U<<21)
#define DPPIC_CHENCLR_CH20_DISABLED             (0x0U<<20)
#define DPPIC_CHENCLR_CH20_ENABLED              (0x1U<<20)
#define DPPIC_CHENCLR_CH20_CLEAR                (0x1U<<20)
#define DPPIC_CHENCLR_CH19_DISABLED             (0x0U<<19)
#define DPPIC_CHENCLR_CH19_ENABLED              (0x1U<<19)
#define DPPIC_CHENCLR_CH19_CLEAR                (0x1U<<19)
#define DPPIC_CHENCLR_CH18_DISABLED             (0x0U<<18)
#define DPPIC_CHENCLR_CH18_ENABLED              (0x1U<<18)
#define DPPIC_CHENCLR_CH18_CLEAR                (0x1U<<18)
#define DPPIC_CHENCLR_CH17_DISABLED             (0x0U<<17)
#define DPPIC_CHENCLR_CH17_ENABLED              (0x1U<<17)
#define DPPIC_CHENCLR_CH17_CLEAR                (0x1U<<17)
#define DPPIC_CHENCLR_CH16_DISABLED             (0x0U<<16)
#define DPPIC_CHENCLR_CH16_ENABLED              (0x1U<<16)
#define DPPIC_CHENCLR_CH16_CLEAR                (0x1U<<16)
#define DPPIC_CHENCLR_CH15_DISABLED             (0x0U<<15)
#define DPPIC_CHENCLR_CH15_ENABLED              (0x1U<<15)
#define DPPIC_CHENCLR_CH15_CLEAR                (0x1U<<15)
#define DPPIC_CHENCLR_CH14_DISABLED             (0x0U<<14)
#define DPPIC_CHENCLR_CH14_ENABLED              (0x1U<<14)
#define DPPIC_CHENCLR_CH14_CLEAR                (0x1U<<14)
#define DPPIC_CHENCLR_CH13_DISABLED             (0x0U<<13)
#define DPPIC_CHENCLR_CH13_ENABLED              (0x1U<<13)
#define DPPIC_CHENCLR_CH13_CLEAR                (0x1U<<13)
#define DPPIC_CHENCLR_CH12_DISABLED             (0x0U<<12)
#define DPPIC_CHENCLR_CH12_ENABLED              (0x1U<<12)
#define DPPIC_CHENCLR_CH12_CLEAR                (0x1U<<12)
#define DPPIC_CHENCLR_CH11_DISABLED             (0x0U<<11)
#define DPPIC_CHENCLR_CH11_ENABLED              (0x1U<<11)
#define DPPIC_CHENCLR_CH11_CLEAR                (0x1U<<11)
#define DPPIC_CHENCLR_CH10_DISABLED             (0x0U<<10)
#define DPPIC_CHENCLR_CH10_ENABLED              (0x1U<<10)
#define DPPIC_CHENCLR_CH10_CLEAR                (0x1U<<10)
#define DPPIC_CHENCLR_CH9_DISABLED              (0x0U<<9)
#define DPPIC_CHENCLR_CH9_ENABLED               (0x1U<<9)
#define DPPIC_CHENCLR_CH9_CLEAR                 (0x1U<<9)
#define DPPIC_CHENCLR_CH8_DISABLED              (0x0U<<8)
#define DPPIC_CHENCLR_CH8_ENABLED               (0x1U<<8)
#define DPPIC_CHENCLR_CH8_CLEAR                 (0x1U<<8)
#define DPPIC_CHENCLR_CH7_DISABLED              (0x0U<<7)
#define DPPIC_CHENCLR_CH7_ENABLED               (0x1U<<7)
#define DPPIC_CHENCLR_CH7_CLEAR                 (0x1U<<7)
#define DPPIC_CHENCLR_CH6_DISABLED              (0x0U<<6)
#define DPPIC_CHENCLR_CH6_ENABLED               (0x1U<<6)
#define DPPIC_CHENCLR_CH6_CLEAR                 (0x1U<<6)
#define DPPIC_CHENCLR_CH5_DISABLED              (0x0U<<5)
#define DPPIC_CHENCLR_CH5_ENABLED               (0x1U<<5)
#define DPPIC_CHENCLR_CH5_CLEAR                 (0x1U<<5)
#define DPPIC_CHENCLR_CH4_DISABLED              (0x0U<<4)
#define DPPIC_CHENCLR_CH4_ENABLED               (0x1U<<4)
#define DPPIC_CHENCLR_CH4_CLEAR                 (0x1U<<4)
#define DPPIC_CHENCLR_CH3_DISABLED              (0x0U<<3)
#define DPPIC_CHENCLR_CH3_ENABLED               (0x1U<<3)
#define DPPIC_CHENCLR_CH3_CLEAR                 (0x1U<<3)
#define DPPIC_CHENCLR_CH2_DISABLED              (0x0U<<2)
#define DPPIC_CHENCLR_CH2_ENABLED               (0x1U<<2)
#define DPPIC_CHENCLR_CH2_CLEAR                 (0x1U<<2)
#define DPPIC_CHENCLR_CH1_DISABLED              (0x0U<<1)
#define DPPIC_CHENCLR_CH1_ENABLED               (0x1U<<1)
#define DPPIC_CHENCLR_CH1_CLEAR                 (0x1U<<1)
#define DPPIC_CHENCLR_CH0_DISABLED              (0x0U<<0)
#define DPPIC_CHENCLR_CH0_ENABLED               (0x1U<<0)
#define DPPIC_CHENCLR_CH0_CLEAR                 (0x1U<<0)

// CHG Configuration

#define DPPIC_CHG_CH31                          (0x1U<<31)
#define DPPIC_CHG_CH30                          (0x1U<<30)
#define DPPIC_CHG_CH29                          (0x1U<<29)
#define DPPIC_CHG_CH28                          (0x1U<<28)
#define DPPIC_CHG_CH27                          (0x1U<<27)
#define DPPIC_CHG_CH26                          (0x1U<<26)
#define DPPIC_CHG_CH25                          (0x1U<<25)
#define DPPIC_CHG_CH24                          (0x1U<<24)
#define DPPIC_CHG_CH23                          (0x1U<<23)
#define DPPIC_CHG_CH22                          (0x1U<<22)
#define DPPIC_CHG_CH21                          (0x1U<<21)
#define DPPIC_CHG_CH20                          (0x1U<<20)
#define DPPIC_CHG_CH19                          (0x1U<<19)
#define DPPIC_CHG_CH18                          (0x1U<<18)
#define DPPIC_CHG_CH17                          (0x1U<<17)
#define DPPIC_CHG_CH16                          (0x1U<<16)
#define DPPIC_CHG_CH15                          (0x1U<<15)
#define DPPIC_CHG_CH14                          (0x1U<<14)
#define DPPIC_CHG_CH13                          (0x1U<<13)
#define DPPIC_CHG_CH12                          (0x1U<<12)
#define DPPIC_CHG_CH11                          (0x1U<<11)
#define DPPIC_CHG_CH10                          (0x1U<<10)
#define DPPIC_CHG_CH9                           (0x1U<<9)
#define DPPIC_CHG_CH8                           (0x1U<<8)
#define DPPIC_CHG_CH7                           (0x1U<<7)
#define DPPIC_CHG_CH6                           (0x1U<<6)
#define DPPIC_CHG_CH5                           (0x1U<<5)
#define DPPIC_CHG_CH4                           (0x1U<<4)
#define DPPIC_CHG_CH3                           (0x1U<<3)
#define DPPIC_CHG_CH2                           (0x1U<<2)
#define DPPIC_CHG_CH1                           (0x1U<<1)
#define DPPIC_CHG_CH0                           (0x1U<<0)
#define DPPIC_CHG_CH31_EXCLUDED                 (0x0U<<31)
#define DPPIC_CHG_CH31_INCLUDED                 (0x1U<<31)
#define DPPIC_CHG_CH30_EXCLUDED                 (0x0U<<30)
#define DPPIC_CHG_CH30_INCLUDED                 (0x1U<<30)
#define DPPIC_CHG_CH29_EXCLUDED                 (0x0U<<29)
#define DPPIC_CHG_CH29_INCLUDED                 (0x1U<<29)
#define DPPIC_CHG_CH28_EXCLUDED                 (0x0U<<28)
#define DPPIC_CHG_CH28_INCLUDED                 (0x1U<<28)
#define DPPIC_CHG_CH27_EXCLUDED                 (0x0U<<27)
#define DPPIC_CHG_CH27_INCLUDED                 (0x1U<<27)
#define DPPIC_CHG_CH26_EXCLUDED                 (0x0U<<26)
#define DPPIC_CHG_CH26_INCLUDED                 (0x1U<<26)
#define DPPIC_CHG_CH25_EXCLUDED                 (0x0U<<25)
#define DPPIC_CHG_CH25_INCLUDED                 (0x1U<<25)
#define DPPIC_CHG_CH24_EXCLUDED                 (0x0U<<24)
#define DPPIC_CHG_CH24_INCLUDED                 (0x1U<<24)
#define DPPIC_CHG_CH23_EXCLUDED                 (0x0U<<23)
#define DPPIC_CHG_CH23_INCLUDED                 (0x1U<<23)
#define DPPIC_CHG_CH22_EXCLUDED                 (0x0U<<22)
#define DPPIC_CHG_CH22_INCLUDED                 (0x1U<<22)
#define DPPIC_CHG_CH21_EXCLUDED                 (0x0U<<21)
#define DPPIC_CHG_CH21_INCLUDED                 (0x1U<<21)
#define DPPIC_CHG_CH20_EXCLUDED                 (0x0U<<20)
#define DPPIC_CHG_CH20_INCLUDED                 (0x1U<<20)
#define DPPIC_CHG_CH19_EXCLUDED                 (0x0U<<19)
#define DPPIC_CHG_CH19_INCLUDED                 (0x1U<<19)
#define DPPIC_CHG_CH18_EXCLUDED                 (0x0U<<18)
#define DPPIC_CHG_CH18_INCLUDED                 (0x1U<<18)
#define DPPIC_CHG_CH17_EXCLUDED                 (0x0U<<17)
#define DPPIC_CHG_CH17_INCLUDED                 (0x1U<<17)
#define DPPIC_CHG_CH16_EXCLUDED                 (0x0U<<16)
#define DPPIC_CHG_CH16_INCLUDED                 (0x1U<<16)
#define DPPIC_CHG_CH15_EXCLUDED                 (0x0U<<15)
#define DPPIC_CHG_CH15_INCLUDED                 (0x1U<<15)
#define DPPIC_CHG_CH14_EXCLUDED                 (0x0U<<14)
#define DPPIC_CHG_CH14_INCLUDED                 (0x1U<<14)
#define DPPIC_CHG_CH13_EXCLUDED                 (0x0U<<13)
#define DPPIC_CHG_CH13_INCLUDED                 (0x1U<<13)
#define DPPIC_CHG_CH12_EXCLUDED                 (0x0U<<12)
#define DPPIC_CHG_CH12_INCLUDED                 (0x1U<<12)
#define DPPIC_CHG_CH11_EXCLUDED                 (0x0U<<11)
#define DPPIC_CHG_CH11_INCLUDED                 (0x1U<<11)
#define DPPIC_CHG_CH10_EXCLUDED                 (0x0U<<10)
#define DPPIC_CHG_CH10_INCLUDED                 (0x1U<<10)
#define DPPIC_CHG_CH9_EXCLUDED                  (0x0U<<9)
#define DPPIC_CHG_CH9_INCLUDED                  (0x1U<<9)
#define DPPIC_CHG_CH8_EXCLUDED                  (0x0U<<8)
#define DPPIC_CHG_CH8_INCLUDED                  (0x1U<<8)
#define DPPIC_CHG_CH7_EXCLUDED                  (0x0U<<7)
#define DPPIC_CHG_CH7_INCLUDED                  (0x1U<<7)
#define DPPIC_CHG_CH6_EXCLUDED                  (0x0U<<6)
#define DPPIC_CHG_CH6_INCLUDED                  (0x1U<<6)
#define DPPIC_CHG_CH5_EXCLUDED                  (0x0U<<5)
#define DPPIC_CHG_CH5_INCLUDED                  (0x1U<<5)
#define DPPIC_CHG_CH4_EXCLUDED                  (0x0U<<4)
#define DPPIC_CHG_CH4_INCLUDED                  (0x1U<<4)
#define DPPIC_CHG_CH3_EXCLUDED                  (0x0U<<3)
#define DPPIC_CHG_CH3_INCLUDED                  (0x1U<<3)
#define DPPIC_CHG_CH2_EXCLUDED                  (0x0U<<2)
#define DPPIC_CHG_CH2_INCLUDED                  (0x1U<<2)
#define DPPIC_CHG_CH1_EXCLUDED                  (0x0U<<1)
#define DPPIC_CHG_CH1_INCLUDED                  (0x1U<<1)
#define DPPIC_CHG_CH0_EXCLUDED                  (0x0U<<0)
#define DPPIC_CHG_CH0_INCLUDED                  (0x1U<<0)
